-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Дек 08 2021 г., 09:13
-- Версия сервера: 8.0.24
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `bd_movie`
--

-- --------------------------------------------------------

--
-- Структура таблицы `content`
--

CREATE TABLE `content` (
  `id` int UNSIGNED NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `genre` varchar(25) NOT NULL,
  `genreID_1` tinyint NOT NULL,
  `genreID_2` tinyint NOT NULL,
  `genreID_3` tinyint NOT NULL,
  `genreID_4` tinyint NOT NULL,
  `date` year NOT NULL,
  `rate` tinyint NOT NULL,
  `img` varchar(500) NOT NULL,
  `description` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `content`
--

INSERT INTO `content` (`id`, `name`, `genre`, `genreID_1`, `genreID_2`, `genreID_3`, `genreID_4`, `date`, `rate`, `img`, `description`) VALUES
(11, 'Привид в латах', 'Аніме', 1, 2, 3, 4, 1995, 0, 'GITS1.png', 'Альтернативний світ 2029 року - світ, у якому співіснують люди і високотехнологічні кіборги, здатні напряму взаємодіяти з Мережею. Головний персонаж фільму - майор Дев\'ятого відділу Кусанаґі Мотоко - кіборг з людським розумом усередині кібернетичного тіла. Основне завдання відділу - спіймати оголошеного в міжнародний розшук невловимого хакера, який через велику кількість жертв його діяльності та мимовільних посібників злочинів отримав прізвисько \"Лялькар\". Згодом виявляється, що насправді все не так, як здається на перший погляд... У фільмі ставиться безліч питань. Що саме робить нас нами? Що таке людська свідомість: безперервний ланцюг електричних імпульсів нервових клітин чи звичайнісінький потік даних, згенерованих невідомим хакером? Де проходить межа між \"я\" і \"не-я\", людиною і лялькою, душею та штучним інтелектом, життям та смертю?'),
(12, 'Привид в латах 2. Невинність', 'Драми, Трилери, Аніме', 1, 0, 0, 0, 2004, 0, 'GITS2.png', ''),
(13, 'Привид в латах 2.0', 'Аніме', 0, 0, 1, 0, 2008, 0, 'GITS3.png', ''),
(16, 'Дух у Латах: С.С. - С.С.С. Дух у Латах: Синдром Самітника - Суспільство Спаяного Стану', 'Аніме', 0, 1, 2, 0, 2006, 0, 'GITS4.png', ''),
(17, 'Остання межа', 'Військові , Драми', 0, 0, 0, 1, 2019, 0, 'TLFM.png', ''),
(18, 'Мер Кінґстауна', 'Драма, Трилери', 8, 11, 9, 1, 2021, 0, 'MK.png', 'Дія кримінального серіалу «Мер Кінґстауна» відбувається у невеликому містечку штату Мічиган, де панує несправедливість, Неповага до людей та повна відсутність права голосу. Поступово поселення вимирає, люди намагаються втекти від расизму, нестачі грошей, життя у вічному страху та болі. Самопроголошений мер називає себе господарем міста, адже контролює кожен його закуток. Єдиними процвітаючими галузями промисловості в Кінгстауні залишаються в\'язниці, які сім\'я Макласкі вважає майже своєю власністю. Вони будують бізнес, який є протизаконним, але приносить великі гроші. Міріам працює викладачем у в\'язниці, а її син – брудний мер, який приховує від жінки безліч таємниць. Їм доводиться виживати у корупційному світі, і Майк Макласкі намагається зробити все можливе, щоб відновити лад у місті. Він робить жахливу помилку, яка спричиняє ланцюг серйозних подій. Майк, як і раніше, займає свою посаду, але вже не отримує поваги мешканців. Його засуджує навіть власна сім\'я, поки чоловік намагається знайти вихід із скрутного становища.');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `content`
--
ALTER TABLE `content`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `content`
--
ALTER TABLE `content`
  MODIFY `id` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
